app/Models/NewModel.php

    public function get_payment_modes()
    {
        $query = $this->db->table('tbl_mop');
        $query->select('id,name');
        $query->where('status', 0);
        return $query->get()->getResultArray();
---
SELECT `id`, `name`
FROM `tbl_mop`
WHERE `status` = 0

public function get_totals()
{
    $builder = $this->db->table('tbl_transaction');

    // Total Income (type = 1)
    $income = $builder->selectSum('amount')
        ->where(['type' => 1, 'status' => 0])
        ->get()
        ->getRowArray()['amount'] ?? 0;

    // Total Expense (type = 2)
    $expense = $builder->selectSum('amount')
        ->where(['type' => 2, 'status' => 0])
        ->get()
        ->getRowArray()['amount'] ?? 0;
---
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 1
AND `status` = 0
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 2
AND `status` = 0

public function get_dashboard_summary()
{
    $builder = $this->db->table('tbl_transaction');

    // TODAY
    $today = date('Y-m-d');
    $today_income = $builder->selectSum('amount')->where(['type'=>1,'status'=>0,'date'=>$today])->get()->getRowArray()['amount'] ?? 0;
    $today_expense = $builder->selectSum('amount')->where(['type'=>2,'status'=>0,'date'=>$today])->get()->getRowArray()['amount'] ?? 0;

    // MONTH
    $month = date('m');
    $year  = date('Y');
    $month_income = $builder->selectSum('amount')
        ->where('type',1)
        ->where('status',0)
        ->where('MONTH(date)',$month)
        ->where('YEAR(date)',$year)
        ->get()->getRowArray()['amount'] ?? 0;

    $month_expense = $builder->selectSum('amount')
        ->where('type',2)
        ->where('status',0)
        ->where('MONTH(date)',$month)
        ->where('YEAR(date)',$year)
        ->get()->getRowArray()['amount'] ?? 0;

    // Last 5 transactions
    $last5 = $this->db->table('tbl_transaction')
        ->select('*')
        ->where('status',0)
        ->orderBy('date','DESC')
        ->limit(5)
        ->get()
        ->getResultArray();
---
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 1
AND `status` = 0
AND `date` = '2025-12-15'
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 2
AND `status` = 0
AND `date` = '2025-12-15'
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 1
AND `status` = 0
AND MONTH(date) = '12'
AND YEAR(date) = '2025'
SELECT SUM(`amount`) AS `amount`
FROM `tbl_transaction`
WHERE `type` = 2
AND `status` = 0
AND MONTH(date) = '12'
AND YEAR(date) = '2025'
SELECT *
FROM `tbl_transaction`
WHERE `status` = 0
ORDER BY `date` DESC
 LIMIT 5

public function get_monthly_totals()
{
    $builder = $this->db->table('tbl_transaction');

    $results = $builder
        ->select("
            MONTH(date) as month,
            SUM(CASE WHEN type = 1 THEN amount ELSE 0 END) as income,
            SUM(CASE WHEN type = 2 THEN amount ELSE 0 END) as expense
        ")
        ->where('status', 0)
        ->groupBy("YEAR(date), MONTH(date)")
        ->orderBy("YEAR(date), MONTH(date)")
        ->limit(12)
        ->get()
        ->getResultArray();
---
SELECT MONTH(date) as month, SUM(CASE WHEN type = 1 THEN amount ELSE 0 END) as income, SUM(CASE WHEN type = 2 THEN amount ELSE 0 END) as expense
FROM `tbl_transaction`
WHERE `status` = 0
GROUP BY YEAR(date), MONTH(date)
ORDER BY YEAR(date), MONTH(date)
 LIMIT 12

public function get_category_expense_totals()
{
    $builder = $this->db->table('tbl_transaction t');

    $results = $builder
        ->select("c.name as category, SUM(t.amount) as total")
        ->join('tbl_categories c', 'c.id = t.category', 'left')
        ->where('t.type', 2)
        ->where('t.status', 0)
        ->groupBy('t.category')
        ->get()
        ->getResultArray();
---
SELECT `c`.`name` as `category`, SUM(t.amount) as total
FROM `tbl_transaction` `t`
LEFT JOIN `tbl_categories` `c` ON `c`.`id` = `t`.`category`
WHERE `t`.`type` = 2
AND `t`.`status` = 0
GROUP BY `t`.`category`

public function get_category_totals($type)
{
    $query = $this->db->table('tbl_transaction t');

    $query->select('c.name as category_name, SUM(t.amount) as total_amount');
    $query->join('tbl_categories c', 't.category = c.id', 'left');

    // Dynamic type
    $query->where(['t.type' => $type, 't.status' => 0]);

    $query->groupBy('t.category');
    $query->orderBy('total_amount', 'DESC');

    return $query->get()->getResultArray();
---
SELECT `c`.`name` as `category_name`, SUM(t.amount) as total_amount
FROM `tbl_transaction` `t`
LEFT JOIN `tbl_categories` `c` ON `t`.`category` = `c`.`id`
WHERE `t`.`type` = 1
AND `t`.`status` = 0
GROUP BY `t`.`category`
ORDER BY `total_amount` DESC

public function get_soa_report($payment_mode = null, $from_date = null, $to_date = null)
{
    $query = $this->db->table('tbl_transaction t');

    // Select fields including category name
    $query->select('
        t.id,
        t.date,
        t.type,
        t.amount,
        t.payment_mode,
        c.name AS category_name
    ');

    // Join category table
    $query->join('tbl_categories c', 't.category = c.id', 'left');

    // Only active transactions
    $query->where('t.status', 0);

    // Payment mode filter
    if (!empty($payment_mode)) {
        $query->where('t.payment_mode', $payment_mode);
    } else {
        // Default to "Bank Transfer" if payment_mode is not set
        $bank = $this->db->table('tbl_mop')
            ->select('id')
            ->where('LOWER(name)', 'bank transfer')
            ->get()
            ->getRowArray();
---
SELECT `id`
FROM `tbl_mop`
WHERE LOWER(name) = 'bank transfer'